<h1>О проекте</h1>
<p>Привет. Меня завут Павел и этот проект мое тестовое задание.</p>

<p>Было получено следвющее ТЗ:</p>
    <br>


<p>Необходимо создать приложение-задачник.</p>
<p>Задачи состоят из:</p>
<ul>
    <li>- имени пользователя;</li>
    <li>- е-mail;</li>
    <li>- текста задачи;</li>
</ul>
<p>Стартовая страница - список задач с возможностью сортировки по имени пользователя, email и статусу. Вывод задач нужно сделать страницами по 3 штуки (с пагинацией). Видеть список задач и создавать новые может любой посетитель без авторизации.</p>

<p>Сделайте вход для администратора (логин "admin", пароль "123"). Администратор имеет возможность редактировать текст задачи и поставить галочку о выполнении. Выполненные задачи в общем списке выводятся с соответствующей отметкой "отредактировано администратором".</p>

<p>В приложении нужно с помощью чистого PHP реализовать модель MVC. Фреймворки PHP использовать нельзя, библиотеки - можно. Этому приложению не нужна сложная архитектура, решите поставленные задачи минимально необходимым количеством кода. Верстка на bootstrap, к дизайну особых требований нет.</p>

<p>Результат нужно развернуть на любом бесплатном хостинге (например - zzz.com.ua), чтобы можно было посмотреть его в действии. Код можно выложить на github или bitbucket.</p>

<p>Материалы:</p>
<p><a href="https://habr.com/ru/post/320480/">https://habr.com/ru/post/320480/</a></p>
<p><a href="https://packagist.org/packages/aura/auth">Пакет авторизации aura/auth</a></p>
